In [30]:
import pandas as pd
# import psycopg2 as psy
import sqlalchemy # Thư viện dành cho hiển thị sql trong file

# Import thư viện kết nối với postgresql
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:98919891@153.92.214.210:5432/er_sample')

# Bắt đầu cho phép sử dụng sql trong dòng lệnh
%load_ext sql

# Khởi tạo kết nối với server database
%sql postgresql://postgres:98919891@153.92.214.210:5432/er_sample

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

<h1> CHAPTER 21 <h1/>

1 出版社のレコードを追加しなさい。なお、各カラムの値は出版社 ID を P0009、出版社名を技術評価社、所在地
(都道府県)を東京都とする。

In [4]:
%%sql
/*
+ Thêm thông tin: 
     mã nhà xuất bản:P0009
     ,tên nhà xuất bản: 技術評価社
     ,địa chỉ: 東京都
+ Tại bảng
    publisher
+ Điều kiện:  
+ Hiển thị:
*/
INSERT INTO publisher VALUES ('P0009', '技術評価社','東京都')

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
1 rows affected.

[]

In [5]:
%%sql
-- check the new insert
SELECT 
    *
FROM 
    publisher
WHERE
    publisher_id = 'P0009'
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
1 rows affected.

[('P0009', '技術評価社', '東京都')]

2 書籍のレコードを追加しなさい。なお、各カラムの値は書籍 ID を B0000090、書籍名をあしたのジョジョ、価格を
500、値引き金額を 50、カテゴリ ID を C009、出版社 ID を P0009、ページ数を 123、ISBN 番号を 978-
4894718492、発売日を 2012 年 7 月 3 日とする。

In [6]:
%%sql
/*
+ Thêm thông tin: 
      ID : B0000090
      ,書籍名:あしたのジョジョ
      ,価格:500
      ,値引き金額: 50
      ,カテゴリ ID:C009
      ,出版社 ID:P0009
      ,ページ数: 123
      ,ISBN 番号: 978-4894718492
      ,発売日を 2012 年 7 月 3 日
+ Tại bảng
    book
+ Điều kiện:  
+ Hiển thị:
*/
INSERT INTO book VALUES ('B0000090', 'あしたのジョジョ',500,50,'C009','P0009',123,'978-4894718492','2012-07-03')

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
1 rows affected.

[]

In [7]:
%%sql
-- check the new insert
SELECT 
    *
FROM 
    book
WHERE
    book_id = 'B0000090'
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
1 rows affected.

[('B0000090', 'あしたのジョジョ', 500, 50, 'C009', 'P0009', 123, '978-4894718492', datetime.date(2012, 7, 3))]

3 クレジットカード会社のレコードをもとに出版社のレコードを追加しなさい。なお、出版社 ID を「P00」+クレジットカ
ード会社 ID の先頭 2 文字、出版社名をクレジットカード会社名+「出版」、所在地(都道府県)をクレジットカード会
社の所在地(都道府県)とする。

In [9]:
%%sql
/*
+ Thêm thông tin: 
    từ bảng công ty thẻ vào bảng nhà xuất bản
+ Tại bảng
    card_company -> publisher
+ Điều kiện:   
    ID mới : Tên nhà xuất bản [P00] + 2 chữ cái đầu mã ID tên công ty thẻ
        ví dụ: cty thẻ AMEX -> 'P00AM'
    Tên mới: Tên công thẻ + 出版
        ví dụ: ラクトン -> 'ラクトン出版'
    Địa chỉ sử dụng địa chỉ của cty thẻ
+ Hiển thị: 
    
*/
INSERT INTO publisher
SELECT
    'P00' || SUBSTR(card_company_id,1,2)
    ,card_company_name || '出版'
    ,prefecture
FROM
    card_company

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
4 rows affected.

[]

In [23]:
%%sql
-- check the new insert
SELECT 
    *
FROM 
    publisher
WHERE
    publisher_id SIMILAR TO '%(AM|RK|SA|VI)'
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
4 rows affected.

[('P00AM', 'アメリカンエックス出版', '東京都'),
 ('P00RK', 'ラクトン出版', '宮城県'),
 ('P00SA', 'セゾナ出版', '千葉県'),
 ('P00VI', 'ビゼ出版', '神奈川県')]

4 業種のレコードを追加しなさい。なお、各カラムの値は業種 ID を BT999、業種名を建設業とする。

In [25]:
%%sql
/*
+ Thêm thông tin: 
     mã ngành kinh doanh: BT999
     ,tên ngành kinh doanh: 建設業
+ Tại bảng
    business_type
+ Điều kiện:  
+ Hiển thị:
*/
INSERT INTO business_type VALUES ('BT999', '建設業')

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
1 rows affected.

[]

In [27]:
%%sql
-- check the new insert
SELECT 
    *
FROM 
    business_type
WHERE
    business_type_id = 'BT999'
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
1 rows affected.

[('BT999', '建設業')]

5 会員のレコードを追加しなさい。なお、各カラムの値は会員 ID を M999、パスワードを jrtxnex、姓を山田、名を
一郎、郵便番号を 123-4567、住所を東京都渋谷区新橋 1-2-3、生年月日を 1980 年 1 月 1 日、電話番号を
00-9876-5432、メールアドレスを ichi@1t10hi.com、登録日を 2005 年 5 月 31 日、会員区分を正会員、子
供の名前を花子とする。

In [42]:
%%sql
/*
+ Thêm thông tin: 
    会員 ID : M999
    ,パスワード: jrtxnex
    ,姓:山田
    ,名: 一郎
    ,郵便番号: 123-4567
    ,住所:東京都渋谷区新橋 1-2-3
    ,生年月日: 1980 年 1 月 1 日
    ,電話番号: 00-9876-5432
    ,メールアドレス: ichi@1t10hi.com
    ,登録日: 2005 年 5 月 31 日
    ,会員区分:正会員
    ,子供の名前:花子
+ Tại bảng
    member
+ Điều kiện:   
+ Hiển thị:     
*/

INSERT INTO member VALUES ('M999','jrtxnex','山田','一郎','123-4567','東京都渋谷区新橋 1-2-3'
                           ,'1980-01-01','00-9876-5432','ichi@1t10hi.com','2005-05-31',1
                           ,NULL,NULL,NULL,'花子',NULL,NULL)

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
1 rows affected.

[]

In [43]:
%%sql
-- check the new insert
SELECT 
    *
FROM 
    member
WHERE
    member_id = 'M999'
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
1 rows affected.

[('M999', 'jrtxnex', '山田', '一郎', '123-4567', '東京都渋谷区新橋 1-2-3', datetime.date(1980, 1, 1), '00-9876-5432', 'ichi@1t10hi.com', datetime.datetime(2005, 5, 31, 0, 0), '1', None, None, None, '花子', None, None)]

6 会員クレジットカードのレコードを追加しなさい。なお、各カラムの値は会員 ID を M999、会員クレジットカード ID
を 1、カード会社 ID を VISE、カード番号を 9876-5432-1012-3333、有効期限年を 2018 年、有効期限月を
12 月とする。

In [44]:
%%sql
INSERT INTO member_card VALUES
(
'M999',1,'VISE','9876-5432-1012-3333',18,12
)

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
1 rows affected.

[]

In [45]:
%%sql
-- check the new insert
SELECT 
    *
FROM 
    member_card
WHERE
    member_id = 'M999'
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
1 rows affected.

[('M999', 1, 'VISE', '9876-5432-1012-3333', '18', '12')]